---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleBackTaperThread
source: html/f5f3bf48-fd23-fc8d-7802-f6d1915739b1.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemHoleBackTaperThread Property

"Back taper thread"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemHoleBackTaperThread { get; }
```